results/redis_bench.txt
=== Redis Benchmark Results ===
--------------------------------------------------------
Pipeline Depth: 1
--------------------------------------------------------
docker : Writing results to stdout
At C:\Users\lokes\Downloads\redis-vs-memcached-caching-benchmark-main\scripts\run_benchmarks.ps1:16 char:3
+   docker run --rm --network caching_benchmark_network redislabs/memti ...
+   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Writing results to stdout:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 63%,   0 secs]  2 threads 10 conns:      125439 ops,  125457 (avg:  125457) ops/sec, 8.99MB/sec (avg: 
8.99MB/sec),  0.16 (avg:  0.16) msec latency
[RUN #1 100%,   1 secs]  0 threads 10 conns:      200000 ops,  125457 (avg:  124839) ops/sec, 8.99MB/sec (avg: 
8.94MB/sec),  0.16 (avg:  0.16) msec latency

warning: GET miss rate 100.00% above target 1.00% (20000 misses / 20000 ops)
2         Threads
10        Connections per thread
10000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       297435.61          ---          ---         0.16005         0.15100         0.43900         1.02300     22944.92 
Gets        33048.40         0.00     33048.40         0.15996         0.15100         0.43900         0.90300      1290.69 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     330484.01         0.00     33048.40         0.16004         0.15100         0.43900         1.00700     24235.61 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.071        5.000
SET       0.087       10.000
SET       0.103       15.000
SET       0.111       20.000
SET       0.119       25.000
SET       0.127       30.000
SET       0.135       35.000
SET       0.143       40.000
SET       0.143       45.000
SET       0.151       50.000
SET       0.151       52.500
SET       0.159       55.000
SET       0.159       57.500
SET       0.159       60.000
SET       0.167       62.500
SET       0.167       65.000
SET       0.175       67.500
SET       0.175       70.000
SET       0.183       72.500
SET       0.183       75.000
SET       0.191       76.250
SET       0.191       77.500
SET       0.191       78.750
SET       0.199       80.000
SET       0.199       81.250
SET       0.207       82.500
SET       0.207       83.750
SET       0.215       85.000
SET       0.223       86.250
SET       0.231       87.500
SET       0.231       88.125
SET       0.231       88.750
SET       0.239       89.375
SET       0.239       90.000
SET       0.247       90.625
SET       0.255       91.250
SET       0.255       91.875
SET       0.263       92.500
SET       0.271       93.125
SET       0.271       93.750
SET       0.279       94.062
SET       0.279       94.375
SET       0.287       94.688
SET       0.287       95.000
SET       0.295       95.312
SET       0.303       95.625
SET       0.303       95.938
SET       0.311       96.250
SET       0.319       96.562
SET       0.327       96.875
SET       0.327       97.031
SET       0.335       97.188
SET       0.335       97.344
SET       0.343       97.500
SET       0.343       97.656
SET       0.351       97.812
SET       0.359       97.969
SET       0.367       98.125
SET       0.375       98.281
SET       0.383       98.438
SET       0.391       98.516
SET       0.399       98.594
SET       0.407       98.672
SET       0.415       98.750
SET       0.415       98.828
SET       0.431       98.906
SET       0.439       98.984
SET       0.455       99.062
SET       0.463       99.141
SET       0.479       99.219
SET       0.479       99.258
SET       0.487       99.297
SET       0.495       99.336
SET       0.503       99.375
SET       0.511       99.414
SET       0.519       99.453
SET       0.535       99.492
SET       0.551       99.531
SET       0.567       99.570
SET       0.575       99.609
SET       0.591       99.629
SET       0.599       99.648
SET       0.607       99.668
SET       0.623       99.688
SET       0.631       99.707
SET       0.639       99.727
SET       0.655       99.746
SET       0.679       99.766
SET       0.695       99.785
SET       0.727       99.805
SET       0.743       99.814
SET       0.759       99.824
SET       0.783       99.834
SET       0.799       99.844
SET       0.815       99.854
SET       0.855       99.863
SET       0.895       99.873
SET       0.927       99.883
SET       0.991       99.893
SET       1.031       99.902
SET       1.047       99.907
SET       1.063       99.912
SET       1.087       99.917
SET       1.111       99.922
SET       1.159       99.927
SET       1.199       99.932
SET       1.239       99.937
SET       1.263       99.941
SET       1.319       99.946
SET       1.351       99.951
SET       1.391       99.954
SET       1.439       99.956
SET       1.471       99.958
SET       1.479       99.961
SET       1.511       99.963
SET       1.543       99.966
SET       1.575       99.968
SET       1.607       99.971
SET       1.623       99.973
SET       1.655       99.976
SET       1.751       99.977
SET       1.807       99.978
SET       1.855       99.979
SET       1.855       99.980
SET       1.879       99.982
SET       1.887       99.983
SET       1.895       99.984
SET       1.895       99.985
SET       1.903       99.987
SET       1.911       99.988
SET       1.919       99.988
SET       1.935       99.989
SET       1.943       99.990
SET       1.959       99.990
SET       1.975       99.991
SET       1.983       99.991
SET       2.063       99.992
SET       2.079       99.993
SET       2.079       99.993
SET       2.095       99.994
SET       2.095       99.994
SET       2.111       99.995
SET       2.111       99.995
SET       2.111       99.995
[...]
SET       2.127       99.996
SET       2.127       99.996
SET       2.159       99.996
SET       2.159       99.997
SET       2.159       99.997
SET       2.159       99.997
[...]
SET       2.159       99.998
SET       2.159       99.998
SET       2.159       99.998
[...]
SET       2.175       99.998
SET       2.175       99.999
SET       2.175       99.999
SET       2.175       99.999
[...]
SET       2.223       99.999
SET       2.223       99.999
SET       2.223       99.999
[...]
SET       2.415       99.999
SET       2.415      100.000
---
GET       0.023        0.000
GET       0.071        5.000
GET       0.087       10.000
GET       0.103       15.000
GET       0.111       20.000
GET       0.119       25.000
GET       0.127       30.000
GET       0.135       35.000
GET       0.143       40.000
GET       0.143       45.000
GET       0.151       50.000
GET       0.151       52.500
GET       0.151       55.000
GET       0.159       57.500
GET       0.159       60.000
GET       0.167       62.500
GET       0.167       65.000
GET       0.175       67.500
GET       0.175       70.000
GET       0.183       72.500
GET       0.183       75.000
GET       0.191       76.250
GET       0.191       77.500
GET       0.199       78.750
GET       0.199       80.000
GET       0.199       81.250
GET       0.207       82.500
GET       0.207       83.750
GET       0.215       85.000
GET       0.223       86.250
GET       0.231       87.500
GET       0.231       88.125
GET       0.231       88.750
GET       0.239       89.375
GET       0.239       90.000
GET       0.247       90.625
GET       0.255       91.250
GET       0.255       91.875
GET       0.263       92.500
GET       0.271       93.125
GET       0.271       93.750
GET       0.279       94.062
GET       0.279       94.375
GET       0.287       94.688
GET       0.287       95.000
GET       0.295       95.312
GET       0.295       95.625
GET       0.303       95.938
GET       0.311       96.250
GET       0.311       96.562
GET       0.319       96.875
GET       0.327       97.031
GET       0.327       97.188
GET       0.335       97.344
GET       0.343       97.500
GET       0.351       97.656
GET       0.351       97.812
GET       0.359       97.969
GET       0.367       98.125
GET       0.375       98.281
GET       0.383       98.438
GET       0.391       98.516
GET       0.399       98.594
GET       0.407       98.672
GET       0.407       98.750
GET       0.423       98.828
GET       0.431       98.906
GET       0.439       98.984
GET       0.447       99.062
GET       0.463       99.141
GET       0.479       99.219
GET       0.487       99.258
GET       0.495       99.297
GET       0.511       99.336
GET       0.519       99.375
GET       0.535       99.414
GET       0.543       99.453
GET       0.551       99.492
GET       0.559       99.531
GET       0.575       99.570
GET       0.591       99.609
GET       0.591       99.629
GET       0.607       99.648
GET       0.607       99.668
GET       0.623       99.688
GET       0.623       99.707
GET       0.639       99.727
GET       0.647       99.746
GET       0.671       99.766
GET       0.687       99.785
GET       0.711       99.805
GET       0.719       99.814
GET       0.719       99.824
GET       0.735       99.834
GET       0.759       99.844
GET       0.767       99.854
GET       0.775       99.863
GET       0.791       99.873
GET       0.831       99.883
GET       0.903       99.893
GET       0.927       99.902
GET       0.959       99.907
GET       0.991       99.912
GET       0.999       99.917
GET       0.999       99.922
GET       1.015       99.927
GET       1.055       99.932
GET       1.055       99.937
GET       1.071       99.941
GET       1.111       99.946
GET       1.119       99.951
GET       1.119       99.954
GET       1.343       99.956
GET       1.343       99.958
GET       1.359       99.961
GET       1.359       99.963
GET       1.599       99.966
GET       1.599       99.968
GET       1.823       99.971
GET       1.823       99.973
GET       1.855       99.976
GET       1.855       99.977
GET       1.855       99.978
GET       1.855       99.979
GET       1.855       99.980
GET       1.855       99.982
GET       1.855       99.983
GET       1.855       99.984
GET       1.879       99.985
GET       1.879       99.987
GET       1.879       99.988
GET       1.879       99.988
GET       1.879       99.989
GET       1.879       99.990
GET       1.895       99.990
GET       1.895       99.991
GET       1.895       99.991
GET       1.895       99.992
GET       1.895       99.993
GET       1.895       99.993
GET       1.895       99.994
GET       1.895       99.994
GET       1.895       99.995
GET       1.895       99.995
GET       2.079       99.995
GET       2.079      100.000
---
WAIT      0.000      100.000



--------------------------------------------------------
Pipeline Depth: 10
--------------------------------------------------------
docker : Writing results to stdout
At C:\Users\lokes\Downloads\redis-vs-memcached-caching-benchmark-main\scripts\run_benchmarks.ps1:16 char:3
+   docker run --rm --network caching_benchmark_network redislabs/memti ...
+   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Writing results to stdout:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   0 secs]  0 threads 10 conns:      200000 ops,       0 (avg:  748508) ops/sec, 0.00KB/sec (avg: 
53.60MB/sec),  0.00 (avg:  0.26) msec latency

warning: GET miss rate 100.00% above target 1.00% (20000 misses / 20000 ops)
2         Threads
10        Connections per thread
10000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       678643.47          ---          ---         0.26546         0.25500         0.57500         1.86300     52352.23 
Gets        75404.83         0.00     75404.83         0.26546         0.25500         0.57500         1.86300      2944.91 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     754048.30         0.00     75404.83         0.26546         0.25500         0.57500         1.86300     55297.15 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.151        5.000
SET       0.175       10.000
SET       0.191       15.000
SET       0.199       20.000
SET       0.207       25.000
SET       0.223       30.000
SET       0.231       35.000
SET       0.239       40.000
SET       0.247       45.000
SET       0.255       50.000
SET       0.263       52.500
SET       0.263       55.000
SET       0.271       57.500
SET       0.271       60.000
SET       0.279       62.500
SET       0.287       65.000
SET       0.287       67.500
SET       0.295       70.000
SET       0.303       72.500
SET       0.303       75.000
SET       0.311       76.250
SET       0.311       77.500
SET       0.319       78.750
SET       0.319       80.000
SET       0.319       81.250
SET       0.327       82.500
SET       0.327       83.750
SET       0.335       85.000
SET       0.343       86.250
SET       0.351       87.500
SET       0.351       88.125
SET       0.359       88.750
SET       0.359       89.375
SET       0.367       90.000
SET       0.367       90.625
SET       0.375       91.250
SET       0.383       91.875
SET       0.391       92.500
SET       0.399       93.125
SET       0.407       93.750
SET       0.407       94.062
SET       0.415       94.375
SET       0.423       94.688
SET       0.423       95.000
SET       0.431       95.312
SET       0.439       95.625
SET       0.439       95.938
SET       0.447       96.250
SET       0.455       96.562
SET       0.463       96.875
SET       0.471       97.031
SET       0.479       97.188
SET       0.479       97.344
SET       0.487       97.500
SET       0.495       97.656
SET       0.503       97.812
SET       0.511       97.969
SET       0.519       98.125
SET       0.519       98.281
SET       0.535       98.438
SET       0.535       98.516
SET       0.543       98.594
SET       0.543       98.672
SET       0.551       98.750
SET       0.559       98.828
SET       0.567       98.906
SET       0.575       98.984
SET       0.583       99.062
SET       0.599       99.141
SET       0.607       99.219
SET       0.615       99.258
SET       0.615       99.297
SET       0.631       99.336
SET       0.631       99.375
SET       0.647       99.414
SET       0.655       99.453
SET       0.663       99.492
SET       0.679       99.531
SET       0.687       99.570
SET       0.703       99.609
SET       0.719       99.629
SET       0.719       99.648
SET       0.735       99.668
SET       0.751       99.688
SET       0.767       99.707
SET       0.775       99.727
SET       0.783       99.746
SET       0.823       99.766
SET       0.879       99.785
SET       0.935       99.805
SET       0.959       99.814
SET       0.999       99.824
SET       1.015       99.834
SET       1.055       99.844
SET       1.247       99.854
SET       1.247       99.863
SET       1.295       99.873
SET       1.319       99.883
SET       1.775       99.893
SET       1.919       99.902
SET       1.919       99.907
SET       1.943       99.912
SET       1.943       99.917
SET       1.959       99.922
SET       1.975       99.927
SET       1.999       99.932
SET       2.015       99.937
SET       2.047       99.941
SET       2.063       99.946
SET       2.063       99.951
SET       2.063       99.954
SET       2.095       99.956
SET       2.095       99.958
SET       2.127       99.961
SET       2.127       99.963
SET       2.303       99.966
SET       2.303       99.968
SET       2.303       99.971
SET       2.303       99.973
SET       2.319       99.976
SET       2.319       99.977
SET       2.319       99.978
SET       2.319       99.979
SET       2.351       99.980
SET       2.351       99.982
SET       2.351       99.983
SET       2.351       99.984
SET       2.367       99.985
SET       2.367       99.987
SET       2.367       99.988
SET       2.367       99.988
SET       2.367       99.989
SET       2.367       99.990
SET       2.399       99.990
SET       2.399       99.991
SET       2.399       99.991
SET       2.399       99.992
SET       2.399       99.993
SET       2.399       99.993
SET       2.399       99.994
SET       2.399       99.994
SET       2.399       99.995
SET       2.399       99.995
SET       2.415       99.995
SET       2.415      100.000
---
GET       0.023        0.000
GET       0.151        5.000
GET       0.175       10.000
GET       0.191       15.000
GET       0.199       20.000
GET       0.207       25.000
GET       0.223       30.000
GET       0.231       35.000
GET       0.239       40.000
GET       0.247       45.000
GET       0.255       50.000
GET       0.263       52.500
GET       0.263       55.000
GET       0.271       57.500
GET       0.271       60.000
GET       0.279       62.500
GET       0.287       65.000
GET       0.287       67.500
GET       0.295       70.000
GET       0.303       72.500
GET       0.303       75.000
GET       0.311       76.250
GET       0.311       77.500
GET       0.319       78.750
GET       0.319       80.000
GET       0.319       81.250
GET       0.327       82.500
GET       0.327       83.750
GET       0.335       85.000
GET       0.343       86.250
GET       0.351       87.500
GET       0.351       88.125
GET       0.359       88.750
GET       0.359       89.375
GET       0.367       90.000
GET       0.367       90.625
GET       0.375       91.250
GET       0.383       91.875
GET       0.391       92.500
GET       0.399       93.125
GET       0.407       93.750
GET       0.407       94.062
GET       0.415       94.375
GET       0.423       94.688
GET       0.423       95.000
GET       0.431       95.312
GET       0.439       95.625
GET       0.439       95.938
GET       0.447       96.250
GET       0.455       96.562
GET       0.463       96.875
GET       0.471       97.031
GET       0.479       97.188
GET       0.479       97.344
GET       0.487       97.500
GET       0.495       97.656
GET       0.503       97.812
GET       0.511       97.969
GET       0.519       98.125
GET       0.519       98.281
GET       0.535       98.438
GET       0.535       98.516
GET       0.543       98.594
GET       0.543       98.672
GET       0.551       98.750
GET       0.559       98.828
GET       0.567       98.906
GET       0.575       98.984
GET       0.583       99.062
GET       0.599       99.141
GET       0.607       99.219
GET       0.615       99.258
GET       0.615       99.297
GET       0.631       99.336
GET       0.631       99.375
GET       0.647       99.414
GET       0.655       99.453
GET       0.663       99.492
GET       0.679       99.531
GET       0.687       99.570
GET       0.703       99.609
GET       0.719       99.629
GET       0.719       99.648
GET       0.735       99.668
GET       0.751       99.688
GET       0.767       99.707
GET       0.775       99.727
GET       0.783       99.746
GET       0.823       99.766
GET       0.879       99.785
GET       0.935       99.805
GET       0.959       99.814
GET       0.999       99.824
GET       1.015       99.834
GET       1.055       99.844
GET       1.247       99.854
GET       1.247       99.863
GET       1.295       99.873
GET       1.319       99.883
GET       1.775       99.893
GET       1.919       99.902
GET       1.919       99.907
GET       1.943       99.912
GET       1.943       99.917
GET       1.959       99.922
GET       1.975       99.927
GET       1.999       99.932
GET       2.015       99.937
GET       2.047       99.941
GET       2.063       99.946
GET       2.063       99.951
GET       2.063       99.954
GET       2.095       99.956
GET       2.095       99.958
GET       2.127       99.961
GET       2.127       99.963
GET       2.303       99.966
GET       2.303       99.968
GET       2.303       99.971
GET       2.303       99.973
GET       2.319       99.976
GET       2.319       99.977
GET       2.319       99.978
GET       2.319       99.979
GET       2.351       99.980
GET       2.351       99.982
GET       2.351       99.983
GET       2.351       99.984
GET       2.367       99.985
GET       2.367       99.987
GET       2.367       99.988
GET       2.367       99.988
GET       2.367       99.989
GET       2.367       99.990
GET       2.399       99.990
GET       2.399       99.991
GET       2.399       99.991
GET       2.399       99.992
GET       2.399       99.993
GET       2.399       99.993
GET       2.399       99.994
GET       2.399       99.994
GET       2.399       99.995
GET       2.399       99.995
GET       2.415       99.995
GET       2.415      100.000
---
WAIT      0.000      100.000



--------------------------------------------------------
Pipeline Depth: 50
--------------------------------------------------------
docker : Writing results to stdout
At C:\Users\lokes\Downloads\redis-vs-memcached-caching-benchmark-main\scripts\run_benchmarks.ps1:16 char:3
+   docker run --rm --network caching_benchmark_network redislabs/memti ...
+   ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Writing results to stdout:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,   0 secs]  0 threads 10 conns:      200000 ops,       0 (avg: 1106421) ops/sec, 0.00KB/sec (avg: 
79.24MB/sec),  0.00 (avg:  0.89) msec latency

warning: GET miss rate 100.00% above target 1.00% (20000 misses / 20000 ops)
2         Threads
10        Connections per thread
10000     Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       997246.49          ---          ---         0.89430         0.82300         2.20700         3.82300     76930.06 
Gets       110805.17         0.00    110805.17         0.89430         0.82300         2.20700         3.82300      4327.46 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1108051.66         0.00    110805.17         0.89430         0.82300         2.20700         3.82300     81257.52 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.215        0.000
SET       0.431        5.000
SET       0.495       10.000
SET       0.543       15.000
SET       0.591       20.000
SET       0.623       25.000
SET       0.663       30.000
SET       0.695       35.000
SET       0.735       40.000
SET       0.775       45.000
SET       0.823       50.000
SET       0.847       52.500
SET       0.879       55.000
SET       0.903       57.500
SET       0.935       60.000
SET       0.959       62.500
SET       0.991       65.000
SET       1.023       67.500
SET       1.047       70.000
SET       1.079       72.500
SET       1.111       75.000
SET       1.119       76.250
SET       1.135       77.500
SET       1.151       78.750
SET       1.167       80.000
SET       1.183       81.250
SET       1.199       82.500
SET       1.223       83.750
SET       1.239       85.000
SET       1.255       86.250
SET       1.287       87.500
SET       1.295       88.125
SET       1.311       88.750
SET       1.319       89.375
SET       1.335       90.000
SET       1.351       90.625
SET       1.367       91.250
SET       1.383       91.875
SET       1.407       92.500
SET       1.423       93.125
SET       1.455       93.750
SET       1.471       94.062
SET       1.487       94.375
SET       1.511       94.688
SET       1.527       95.000
SET       1.551       95.312
SET       1.567       95.625
SET       1.591       95.938
SET       1.607       96.250
SET       1.647       96.562
SET       1.671       96.875
SET       1.695       97.031
SET       1.719       97.188
SET       1.727       97.344
SET       1.751       97.500
SET       1.767       97.656
SET       1.807       97.812
SET       1.839       97.969
SET       1.871       98.125
SET       1.911       98.281
SET       1.967       98.438
SET       1.991       98.516
SET       1.999       98.594
SET       2.047       98.672
SET       2.063       98.750
SET       2.143       98.828
SET       2.175       98.906
SET       2.207       98.984
SET       2.271       99.062
SET       2.287       99.141
SET       2.351       99.219
SET       2.351       99.258
SET       2.399       99.297
SET       2.399       99.336
SET       2.447       99.375
SET       2.527       99.414
SET       2.623       99.453
SET       2.767       99.492
SET       2.895       99.531
SET       2.895       99.570
SET       2.911       99.609
SET       2.911       99.629
SET       2.911       99.648
SET       2.927       99.668
SET       2.927       99.688
SET       2.927       99.707
SET       3.247       99.727
SET       3.247       99.746
SET       3.263       99.766
SET       3.311       99.785
SET       3.391       99.805
SET       3.391       99.814
SET       3.391       99.824
SET       3.423       99.834
SET       3.423       99.844
SET       3.759       99.854
SET       3.759       99.863
SET       3.759       99.873
SET       3.823       99.883
SET       3.823       99.893
SET       3.823       99.902
SET       3.823       99.907
SET       3.823       99.912
SET       3.823       99.917
SET       3.823       99.922
SET       3.887       99.927
SET       3.887       99.932
SET       3.887       99.937
SET       3.887       99.941
SET       3.887       99.946
SET       3.919       99.951
SET       3.919       99.954
SET       3.919       99.956
SET       3.919       99.958
SET       3.919       99.961
SET       3.919       99.963
SET       3.919       99.966
SET       3.919       99.968
SET       3.919       99.971
SET       3.919       99.973
SET       3.951       99.976
SET       3.951      100.000
---
GET       0.215        0.000
GET       0.431        5.000
GET       0.495       10.000
GET       0.543       15.000
GET       0.591       20.000
GET       0.623       25.000
GET       0.663       30.000
GET       0.695       35.000
GET       0.735       40.000
GET       0.775       45.000
GET       0.823       50.000
GET       0.847       52.500
GET       0.879       55.000
GET       0.903       57.500
GET       0.935       60.000
GET       0.959       62.500
GET       0.991       65.000
GET       1.023       67.500
GET       1.047       70.000
GET       1.079       72.500
GET       1.111       75.000
GET       1.119       76.250
GET       1.135       77.500
GET       1.151       78.750
GET       1.167       80.000
GET       1.183       81.250
GET       1.199       82.500
GET       1.223       83.750
GET       1.239       85.000
GET       1.255       86.250
GET       1.287       87.500
GET       1.295       88.125
GET       1.311       88.750
GET       1.319       89.375
GET       1.335       90.000
GET       1.351       90.625
GET       1.367       91.250
GET       1.383       91.875
GET       1.407       92.500
GET       1.423       93.125
GET       1.455       93.750
GET       1.471       94.062
GET       1.487       94.375
GET       1.511       94.688
GET       1.527       95.000
GET       1.551       95.312
GET       1.567       95.625
GET       1.591       95.938
GET       1.607       96.250
GET       1.647       96.562
GET       1.671       96.875
GET       1.695       97.031
GET       1.719       97.188
GET       1.727       97.344
GET       1.751       97.500
GET       1.767       97.656
GET       1.807       97.812
GET       1.839       97.969
GET       1.871       98.125
GET       1.911       98.281
GET       1.967       98.438
GET       1.991       98.516
GET       1.999       98.594
GET       2.047       98.672
GET       2.063       98.750
GET       2.143       98.828
GET       2.175       98.906
GET       2.207       98.984
GET       2.271       99.062
GET       2.287       99.141
GET       2.351       99.219
GET       2.351       99.258
GET       2.399       99.297
GET       2.399       99.336
GET       2.447       99.375
GET       2.527       99.414
GET       2.623       99.453
GET       2.767       99.492
GET       2.895       99.531
GET       2.895       99.570
GET       2.911       99.609
GET       2.911       99.629
GET       2.911       99.648
GET       2.927       99.668
GET       2.927       99.688
GET       2.927       99.707
GET       3.247       99.727
GET       3.247       99.746
GET       3.263       99.766
GET       3.311       99.785
GET       3.391       99.805
GET       3.391       99.814
GET       3.391       99.824
GET       3.423       99.834
GET       3.423       99.844
GET       3.759       99.854
GET       3.759       99.863
GET       3.759       99.873
GET       3.823       99.883
GET       3.823       99.893
GET       3.823       99.902
GET       3.823       99.907
GET       3.823       99.912
GET       3.823       99.917
GET       3.823       99.922
GET       3.887       99.927
GET       3.887       99.932
GET       3.887       99.937
GET       3.887       99.941
GET       3.887       99.946
GET       3.919       99.951
GET       3.919       99.954
GET       3.919       99.956
GET       3.919       99.958
GET       3.919       99.961
GET       3.919       99.963
GET       3.919       99.966
GET       3.919       99.968
GET       3.919       99.971
GET       3.919       99.973
GET       3.951       99.976
GET       3.951      100.000
---
WAIT      0.000      100.000